#================================
my_group = "g0EqPy30db19e9426c59c1cc6550ac69"
#گوید گروهتو رو وارد کن.
#================================
admins = ['u0DOKcR074f1c554c8db5b8495f5f278','u0DOKcR074f1c554c8db5b8495f5f278']
#گوید ادمین هاتون رو وارد کنید.
#================================
Filter = [
    'سکس',
    'بیو',
    'https://rubika.ir'
]
#متن های فیلترت رو بزار
#================================
sokhan = [
    "سلام:خوبی",
    "چطوری:عالی",
    "ربات:جان عشقم",
    "چه خبر:دسته تبر",
    "چه خبر:بی خبر",
    "فدات:خاک پات",
    "بای:بای بای",
    "خداحافظ:به امید دیدار",
    "دیوص:ایینه",
    "قربونت:فداتم",
    "چیطوری:عالیم تو چیطوری؟",
    "چه میکنی:در میارم نگا میکنم",
    "ریدی:اره تو دهنت",
    ".:روبیکا ریده؟",
    "باشه:واکن تا جاشه",
    "دیوانه:مخلصم",
    "گمشو:گم نمیشم شناسنامه دارم",
    "دلقک:خودتی",
    "کونی:اینجا گروهه درست صحبت کن",
    "عه:نه به",
    "کیری:مثل قیافت",
    "صلام:چطوری گل؟",
    "چه خبر؟:عالی",
]
#لیست سخنگو رو پر کن
#================================
