from rubpy import Client, Message, handlers, methods
from asyncio import run
from config import *
from googlesearch import search
from pyshorteners import Shortener
import requests
from random import choice
import random
from re import findall, search
from requests import get,post
import traceback
import json
import datetime
from asyncio import run, sleep , gather , ensure_future , create_task
silence_list = []
no_gifs = []

text = "این یک متن است با یک لینک https://example.com و یک لینک دیگر https://example.org"
clean_text = re.sub(r'https?://\S+', '', text)
class Locks:
    def __init__(self):
        self.locks = {
            "هوش مصنوعی": False,
            "حالت سخنگو": False,
            "خوشامد گویی": False,
            "اجرای بازی": False,
            "حالت ضدلینک": True,
            "حالت فروارد": False,
            "عمل حذف گیف": False,
            "قفل نظرسنجی": False,
            "عمل حذف ویس": False,
            "قفل لوکیشن": False,
            "عمل حذف عکس": False,
            "حالت ضدفیلم": False,
            "حالت ضدفایل": False,
            "حالت ضد لایو": False,
            "حالت ضد فحش": False,
            "قفل موزیک": False,
            "قفل روبینو": False,
        }
    def add_to_sokhan(self, new_item):
        keyword, reply = new_item.split(":")
        sokhan.append(f"{keyword}:{reply}")
        return f"عبارت {keyword}:{reply} به لیست اضافه شد."

    def remove_from_sokhan(self, keyword):
        removed_items = [item for item in sokhan if not item.startswith(keyword + ":")]
        deleted_count = len(sokhan) - len(removed_items)
        sokhan.clear()
        sokhan.extend(removed_items)
        return f"{deleted_count} عبارت با کلمه کلیدی {keyword} حذف شدند."

    def edit_sokhan(self, old_item, new_item):
        old_keyword, old_reply = old_item.split(":")
        new_keyword, new_reply = new_item.split(":")
        for i, item in enumerate(sokhan):
            if item == f"{old_keyword}:{old_reply}":
                sokhan[i] = f"{new_keyword}:{new_reply}"
                return f"عبارت {old_keyword}:{old_reply} به {new_keyword}:{new_reply} تغییر یافت."
    def print_locks(self):
        locks_str = "نمایش وضعیت قفل‌ ها:\n"
        for key, value in self.locks.items():
            status = "(❌)" if value else "(✅)"
            locks_str += f"قفل ({key}) = ->{status}\n"  # تغییر این خط
        return locks_str
    
    def toggle_lock(self, lock_type):
        if lock_type in self.locks:
            self.locks[lock_type] = not self.locks[lock_type]
            status = "باز شده" if self.locks[lock_type] else "قفل شده"
            return f"قفل {lock_type} {status}"  # تغییر این خط
        else:
            return "نوع قفل معتبر نیست."
            
async def target(my_array, i: int, client: Client):
    await client.delete_messages(my_group, my_array[i : i + 30])
locks = Locks()
async def deleteMessages(client: Client, replay_message: str):
    
    try:
        messages_ids = []
        messages = await client.get_messages_interval(my_group, replay_message)
        while messages.old_has_continue:
            messages = await client.get_messages_interval(
                my_group, messages.old_max_id
            )
            for messeaged in messages.messages:
                messages_ids.append(messeaged.message_id)
        for i in range(0, len(messages_ids), 30):
            tasks = []
            task = ensure_future(target(messages_ids, i, client))
            tasks.append(task)
        await gather(*tasks)
        message_id = await client.send_message(
            my_group,
            f"تعداد {str(len(messages_ids))} پیام پاک شد !",
            replay_message,
        )
    except:
        message_id = await client.send_message(
            my_group,
            f"تعداد {str(len(messages_ids))} پیام پاک شد !",
            replay_message,
        )
        
async def main():
    async with Client(session="bot") as client:
        @client.on(handlers.MessageUpdates())
        async def updates(message: Message): 
            msg = message.message_id
            req = message.author_guid
            if message.raw_text == "اد":
                await client.set_group_admin(my_group, req, access_list=[])  
                await client.send_message(req,"شما با موفقیت ادمین شدید✅")
            if message.object_guid == my_group:
                print(message.raw_text)
                if message.author_guid in admins and message.raw_text == "بستن گروه":
                    await client.set_group_default_access(my_group, [])
                    await client.send_message(my_group,
                                        message='گروه بسته شد , جهت اد شدن در گروه به پیوی من کلمه **اد** رو بفرستید.',
                                        reply_to_message_id=msg)
                if message.author_guid in admins and message.raw_text == "باز کردن گروه":
                    await client.set_group_default_access(my_group, ['SendMessages'])
                    await client.send_message(my_group,
                                                message='گروه باز شد.',
                                                reply_to_message_id=msg)
                if message.author_guid in admins and message.raw_text == "لیست قفل" or message.raw_text == "/LOCKS":
                    locks_str = "وضعیت قفل‌ها:\n"
                    max_key_length = max(len(key) for key in locks.locks)
                    for key, value in locks.locks.items():
                        status = "(✅)" if value else "(🔐)"
                        formatted_key = key.capitalize()
                        locks_str += f"قفل ({formatted_key.ljust(max_key_length, ' ')}) -> {status}\n"
                    await client.send_message(my_group,locks_str,reply_to_message_id=msg)
#await Client.get_poll_status
#await Client.get_poll_option_voters
#await Client.vote_poll
#await Client.create_poll
                if message.raw_text is not None and message.author_guid in admins and message.raw_text.startswith(("قفل ", "بازکردن ")):
                    parts = message.raw_text.split(" ", 1)
                    if len(parts) == 2:
                        action, lock_type = parts
                        lock_type = lock_type.lower()
                        if action == "بازکردن":
                            if lock_type == "سختگیرانه":
                                for key in locks.locks:
                                    locks.locks[key] = True
                                await client.send_message(my_group,"تمام قفل‌ها باز شدند.",reply_to_message_id=msg)
                            elif lock_type in locks.locks:
                                locks.locks[lock_type] = True
                                formatted_lock_type = lock_type.capitalize()
                                await client.send_message(my_group,f"قفل {formatted_lock_type} باز شد.",reply_to_message_id=msg)
                            else:
                                await client.send_message(my_group,"نوع قفل معتبر نیست.",reply_to_message_id=msg)
                        elif action == "قفل":
                            if lock_type == "سختگیرانه":
                                for key in locks.locks:
                                    locks.locks[key] = False
                                await client.send_message(my_group,"تمام قفل‌ها فعال شدند.",reply_to_message_id=msg)
                            elif lock_type in locks.locks:
                                locks.locks[lock_type] = False
                                formatted_lock_type = lock_type.capitalize()
                                await client.send_message(my_group,f"قفل {formatted_lock_type} بسته شد.",reply_to_message_id=msg)
                            else:
                                await client.send_message(my_group,"نوع قفل معتبر نیست.",reply_to_message_id=msg)
                if message.raw_text and message.raw_text.startswith("یک پیام سنجاق شد."):
                    await message.delete_messages()
                if message.author_guid in admins:
                    result = message.to_dict().get("message")
                    if locks.locks["هوش مصنوعی"] == True:
                        if message.raw_text and message.raw_text.startswith("//"):
                            message_id = message.message_id
                            text_wb = message.text.split("//")[-1]
                            response = requests.get(f"https://haji-api.ir/Free-GPT3/?text={text_wb}&key=hajiapi")
                            data = response.json()
                            message = data["result"]["message"]
                            await client.send_message(my_group,message,reply_to_message_id=message_id)
                    if locks.locks["اجرای بازی"] == True:
                        if message.author_guid in admins and message.raw_text == "دستورات" or message.raw_text == "راهنما" or message.raw_text == "/help":
                            await client.send_message(my_group,"""
                                                    💠 | ᑭᗩᑎᗴᒪ: 

        /SETTING လ تنظیمات

        /CONDITION လ وضعیت

        /LOCKS လ لیست قفل

        /GAMES လ بازی
        ‌‍‍‌‌‍‌‍‍‍‌‌‍‍‌‌‍‌‌‍‍‌‌‍‍‌‍‍‌‍‌‍‌‍‍‌‍‌‌‍‌‍‌‌‍‌‌‍‌‍‌‌‍‌‌‍‍‍‌‍‌‍‍‌‌‍‍‌‌‍‌‌‍‌‍‌‌‍‍‍‍‍‌‍‍‌‌‍‌‍‍‍‌‌‍‍‌‌‍‌‌‍‍‌‌‍‍‌‍‍‌‍‌‍‌‍‍‌‍‌‌‍‌‍‌‌‍‌‌‍‌‍‌‌‍‌‌‍‍‍‌‍‌‍‍‌‌‍‍‌‌‍‌‌‍‌‍‌‌‍‍‍‍‍‌‍‍‌‌‍‌‍‍‍‌‌‍‍‌‌‍‌‌‍‍‌‌‍‍‌‍‍‌‍‌‍‌‍‍‌‍‌‌‍‌‍‌‌‍‌‌‍‌‍‌‌‍‌‌‍‍‍‌‍‌‍‍‌‌‍‍‌‌‍‌‌‍‌‍‌‌‍‍‍‍‍‌‍‍‌‌‍‌‍‍‍‌‌‍‍‌‌‍‌‌‍‍‌‌‍‍‌‍‍‌‍‌‍‌‍‍‌‍‌‌‍‌‍‌‌‍‌‌‍‌‍‌‌‍‌‌‍‍‍‌‍‌‍‍‌‌‍‍‌‌‍‌‌‍‌‍‌‌‍‍‍‍‍‌‍‍‌‌‍‌‍‍‍‌‌‍‍‌‌‍‌‌‍‍‌‌‍‍‌‍‍‌‍‌‍‌‍‍‌‍‌‌‍‌‍‌‌‍‌‌‍‌‍‌‌‍‌‌‍‍‍‌‍‌‍‍‌‌‍‍‌‌‍‌‌‍‌‍‌‌‍‍‍‍‍‌‍‍‌‌‍‌‍‍‍‌‌‍‍‌‌‍‌‌‍‍‌‌‍‍‌‍‍‌‍‌‍‌‍‍‌‍‌‌‍‌‍‌‌‍‌‌‍‌‍‌‌‍‌‌‍‍‍‌‍‌‍‍‌‌‍‍‌‌‍‌‌‍‌‍‌‌‍‍‍‍‍‌‍‍‌‌‍‌‍‍‍‌‌‍‍‌‌‍‌‌‍‍‌‌‍‍‌‍‍‌‍‌‍‌‍‍‌‍‌‌‍‌‍‌‌‍‌‌‍‌‍‌‌‍‌‌‍‍‍‌‍‌‍‍‌‌‍‍‌‌‍‌‌‍‌‍‌‌‍‍‍‍‍‌‍‍‌‌‍‌‍‍‍‌‌‍‍‌‌‍‌‌‍‍‌‌‍‍‌‍‍‌‍‌‍‌‍‍‌‍‌‌‍‌‍‌‌‍‌‌‍‌‍‌‌‍‌‌‍‍‍‌‍‌‍‍‌‌‍‍‌‌‍‌‌‍‌‍‌‌‍‍‍‍‍‌‍‍‌‌‍‌‍‍‍‌‌‍‍‌‌‍‌‌‍‍‌‌‍‍‌‍‍‌‍‌‍‌‍‍‌‍‌‌‍‌‍‌‌‍‌‌‍‌‍‌‌‍‌‌‍‍‍‌‍‌‍‍‌‌‍‍‌‌‍‌‌‍‌‍‌‌‍‍‍‍‍‌‍‍‌‌‍‌‍‍‍‌‌‍‍‌‌‍‌‌‍‍‌‌‍‍‌‍‍‌‍‌‍‌‍‍‌‍‌‌‍‌‍‌‌‍‌‌‍‌‍‌‌‍‌‌‍‍‍‌‍‌‍‍‌‌‍‍‌‌‍‌‌‍‌‍‌‌‍‍‍‍‍‌‍‍‌‌‍‌‍‍‍‌‌‍‍‌‌‍‌‌‍‍‌‌‍‍‌‍‍‌‍‌‍‌‍‍‌‍‌‌‍‌‍‌‌‍‌‌‍‌‍‌‌‍‌‌‍‍‍‌‍‌‍‍‌‌‍‍‌‌‍‌‌‍‌‍‌‌‍‍‍‍‍‌‍‍‌‌‍‌‍‍‍‌‌‍‍‌‌‍‌‌‍‍‌‌‍‍‌‍‍‌‍‌‍‌‍‍‌‍‌‌‍‌‍‌‌‍‌‌‍‌‍‌‌‍‌‌‍‍‍‌‍‌‍‍‌‌‍‍‌‌‍‌‌‍‌‍‌‌‍‍‍‍‍‌‍‍‌‌‌‌
                                                    """,reply_to_message_id=msg)
                        if message.author_guid in admins and message.raw_text == "/SETTING" or message.raw_text == "تنظیمات":
                            await client.send_message(my_group,"""
        1️⃣ قفل و باز کردن :
        📝با ارسال دستور اول گروه باز و با دستور دوم گروه بسته میشود
        ‎ᴥ باز کردن گروه
        ‎ᴥ قفل گروه
            ─┅━━━━┅─
        2️⃣ پاکسازی گروه:
        📝با ارسال این دستور ربات تمامی پیام های گروه رو حذف میکنه
        ‎ᴥ پاکسازی
        ─┅━━━━┅─
        """,reply_to_message_id=msg)
                        if message.author_guid in admins and message.raw_text == "وضعیت" or message.raw_text == "/CONDITION":
                            await client.send_message(my_group,'پلن یک ماهه برای شما فعال است |💠',reply_to_message_id=msg)
                        if message.raw_text == "بازی" or message.raw_text == "/GAMES":
                            await client.send_message(my_group,"""
        1️⃣ ارسال جوک , بیو , دانستنی:
        📝با ارسال کلمات بالا ربات براتون میفرسته
        ‎ᴥ جوک
        ‎ᴥ بیو
        ‎ᴥ دانستنی
        ‎ᴥ بیو
        ─┅━━━━┅─
        2️⃣ارسال ساعت در گروه :
        📝 با ارسال کلمه ساعت ربات ساعت رو برای شما ارسال میکنه
        ‎ᴥ ساعت
        ─┅━━━━┅─
        3️⃣ ترجمه به فارسی و اینگلیسی:
        📝 با این دستور میتونید متنتون رو به فارسی یا اینگلیسی ترجمه کنید
        ‎ᴥ ترجمه به انگلیسی : متنتون فارسیتون رو بنویسید
        ‎ᴥ ترجمه به فارسی : متنتون فارسیتون رو بنویسید
        ─┅━━━━┅─
        4️⃣ ترجمه به فارسی و اینگلیسی:
        📝 با این دستور میتونید متنتون رو به فارسی یا اینگلیسی ترجمه کنید
        ‎ᴥ ترجمه به انگلیسی : متنتون فارسیتون رو بنویسید
        ‎ᴥ ترجمه به فارسی : متنتون فارسیتون رو بنویسید
        ─┅━━━━┅─
        5️⃣ نمایش اوقات شرعی شهرتون :
        📝 با این قابلیت میتونید اقات شرعی شهرتون رو دریافت کنید
        ‎ᴥ اوقات شرعی : اسم شهرتون
        ─┅━━━━┅─
        6️⃣ ساخت فونت برای اسمتون :
        📝 با این قابلیت میتونی برای اسمتون فونت بسازید
        ‎ᴥ فونت : متن فونتتون""",reply_to_message_id=msg)
                        if message.author_guid in admins and message.raw_text == "ایجاد کال":
                            await client.create_voice_call(my_group)
                            await client.send_message(my_group,"کال با موفقعیت ایجاد شد.",reply_to_message_id=msg)
                        if message.raw_text == "دانستنی":
                            rando = ["شمپانزه ها قادرند مقابل آينه چهره خود را تشخيص دهند اما ميمونها نميتوانند.","فیلها قادرند روزانه ۶۰ گالن آب و ۲۵۰ کیلو گرم یونجه مصرف کنند.","سوسكها سريعترين جانوران 6 پا ميباشند. با سرعت يك متر در ثانيه.","وقتی موش ها را قلقلک بدهید میخندند.","بلژیک تنها کشوری است که فیلمهای غیر اخلاقی را سانسور نمیکند.","آیا میـدانستیـد کـه در ماکارونی 20درصد گنوتن صنعتی استفاده می شود که سرطان زاست و در بسیاری کارخانه ها نان خشک کپک زده به جای آرد در ماکارونی استفاده می شود و ماکارونی یبوست زاست ؟","چطوری رشد ابرو ها رو زیاد و تارهای ابرو رو ضخیم کنیم؟ رشد سریع ابرو 👈 دوبار روغن زیتون در روز ضخیم کردن تارهای ابرو 👈 استفاده از وازلین 👌😎","سطح شهر مكزيك سالانه 25 سانتي متر نشست ميكند.","تمامی پستانداران به استثنای انسان و میمون کور رنگ میباشند.","نور خورشيد 8.5 دقيقه طول ميكشد تا به زمين برسد.","اگر يک ماهي قرمز را در يک اتاق تاريک قرار دهيد، کم کم رنگش سفيد ميشود.","دکتر ها در ژاپن یک مغز کوچک را هنگام جراحی تومور تخمدان یک دختر ۱۶ ساله از آن خارج کردند.","صدای ” مومو ” گاو ها در کشورهای مختلف جهان با هم متفاوت است، آنها لهجه های خاص خود را دارند درست مثل انسان.","شما می توانید جنسیت یک اسب را با شمارش تعداد دندان های او تشخیص دهید، بیشتر اسب های جنس نر 40 دندان و اسب های جنس ماده 36 دندان دارند.","70درصد فقراي جهان را زنان تشكيل ميدهند.","در قرن ۱۶ در اروپا اعتقاد بر این بود که خوردن گوجه فرنگی میتواند شما را تبدیل به گرگ کند","کادمیم فلزی سمی است که در ساخت باطری های خشک کاربرد دارد","شيشه در ظاهر جامد به نظر ميرسد ولي در واقع مايعي است که بسيار کند حرکت ميکند.","چطوری مانع رنگ پریدگی لباس های مشکی در شستسو بشیم؟🤔 کافیه 👈 در تشتی یک فنجان سرکه + مایع لباس شویی + اب سرد + کمی مایع ظرفشویی نیم ساعت خیس بخورد سپس با دست لباس را بشویید","ون گوگ در طول حيات خود تنها يكي از نقاشيهاي خود را بفروش رساند.","تمامی خرسهای قطبی چپدست هستند.","يك اسب در طول يك سال 7 برابر وزن بدن خود غذا مصرف ميكند.","كرگدنها قادرند سريعتر از انسانها بدوند.","در سال ۲۰۰۸، پلیس بریتانیا به یک کودک ۷ ساله مجوز حمل اسلحه داد.","سگهاي شهري بطور متوسط 3 سال بيشتر از سگهاي روستايي عمر ميكنند.","آیا میـدانستیـد کـه ماده مخدری به نام cola (پپسی کولا، کوکا کولا و…) در اکثر نوشابه ها وجود دارد که کافئین و کارامل از این دست هستند ؟","انسانها قبل از اینکه زیر چمدان ها چرخ بزارن، یک نفر را روی ماه گذاشتند!","روزانه حدود ۱۵۳۰۰۰ نفر در جهان می‌میرند.","خودروسازي بزرگترين صنعت در جهان ميباشد.","آیا میـدانستیـد کـه گوشت گاو به گفته بوعلی سینا عامل 16 بیماری مهلک می باشد که اولین آن سرطان و دومین آن مالیخولیا (اسکیزوفرنی) و سومی آن بواسیر می باشد. جنون گاوی ویروس و میکروب نیست بلکه نوعی پروتئین گاو است","آیا میـدانستیـد کـه گوشت گاو به گفته بوعلی سینا عامل 16 بیماری مهلک می باشد که اولین آن سرطان و دومین آن مالیخولیا (اسکیزوفرنی) و سومی آن بواسیر می باشد. جنون گاوی ویروس و میکروب نیست بلکه نوعی پروتئین گاو است","فقط پشه های ماده خون میخورند، پشه های نر گیاه خوار هستند.","جویدن آدامس در سنگاپور ممنوع است.","حلزون های بی صدف 4 بینی دارند!","تیولا یا عروس دریایی نامیرا، تنها موجودی شناخته شده است که زندگی جاودانه دارد.","98 درصد وزن آب از اكسيژن تشكيل يافته است.","مرده ها هم موهای تنشان سیخ میشود(مور مور و اینا)","چطوری مانع رنگ پریدگی لباس های مشکی در شستسو بشیم؟🤔 کافیه 👈 در تشتی یک فنجان سرکه + مایع لباس شویی + اب سرد + کمی مایع ظرفشویی نیم ساعت خیس بخورد سپس با دست لباس را بشویید","آیا میـدانستیـد کـه گوشت مرغ و ماهی که متاسفانه سفارش بسیاری از پزشکان است بلغم زاست و موجب سکته و تومور های مختلف می گردند ؟","حس چشایی پروانه ها در پاهای شان می باشد","سگهاي شهري بطور متوسط 3 سال بيشتر از سگهاي روستايي عمر ميكنند.","باقیمانده پیاز رو داخل یخچال قرار ندهید!🤔 پیاز نصف شده به دلیل اینکه پوستی ندارد باکتری های یخچال رو به خود جذب میکند میتونید باقی مانده رو درجایی خشک و خنک نگه دارید👌😎","شرکت کوکا کولا روزانه بیش از 1 میلیارد از محصولات خود را به فروش می رساند.","یک هتل در بولیوی وجود دارد که بطور کامل از نمک ساخته شده، حتی تخت ها و صندلی هایش!","عمر تمساح بيش از 100 سال ميباشد.","آیا میـدانستیـد کـه در نان باگت برای متخلخل شدن از پودرهای بکینگ یا جوش شیرین زیاد استفاده می شود که در گمرک ها با علامت مرگ وارد میشود ؟","آیا میـدانستیـد کـه در نان باگت برای متخلخل شدن از پودرهای بکینگ یا جوش شیرین زیاد استفاده می شود که در گمرک ها با علامت مرگ وارد میشود ؟","ختنه کردن در قرون وسطی به عنوان درمانی برای فتق، صرع و جذام مورد استفاده قرار میگرفت.","مادر و همسر گراهام بل مخترع تلفن هر دو ناشنوا بوده اند.","آیا می دانستید هنگامی که عطسه می کنید، قلب شما برای یک میلی ثانیه متوقف می شود.","سگهاي شهري بطور متوسط 3 سال بيشتر از سگهاي روستايي عمر ميكنند.","اگر پلیس های تایلندی قانون شکنی کنند باید یک بازوبند کیتی ببندند.","لئوناردو داوينچي مخترع قيچي ميباشد.","جغدها قادر به حركت دادن چشمان خود در كاسه چشم نميباشند.","موز پر مصرف ترين ميوه كشور امريكا ميباشد.","کانگرو های ماده ۳ واژن دارند.","آیا میـدانستیـد کـه در نان باگت برای متخلخل شدن از پودرهای بکینگ یا جوش شیرین زیاد استفاده می شود که در گمرک ها با علامت مرگ وارد میشود ؟","ون گوگ در طول حيات خود تنها يكي از نقاشيهاي خود را بفروش رساند.","ون گوگ در طول حيات خود تنها يكي از نقاشيهاي خود را بفروش رساند.","اگر پلیس های تایلندی قانون شکنی کنند باید یک بازوبند کیتی ببندند.","گوسفند ها میتوانند همدیگر را در عکس تشخیص بدهند.","درتمام انسانهای کره زمین ۹۹٫۹ % شباهت ژنتیکی وجود دارد."]
                            renn= choice(rando)
                            await client.send_message(my_group,renn,reply_to_message_id=msg)
                        if message.raw_text == "جوک":
                            rando = ["""
        وقتی بتونم سیب زمینی سرخ کرده هامو با کسی شریک شم می فهمم که عاشق شدم.

        ""","""
        با بابام حرفم شد رفت تو آشپزخونه و به مامانم گفت: واسه خاطر چهل تومن یارانه باید این الدنگ رو تحمل کنیم!""","""
        پسره می ره خواستگاری یه دختری، بابای دختره می گه:

        نه ازت مهریه می خوام، نه خونه، نه ماشین، بیکارم بودی مهم نیست…

        یه لپ تاپ می ذاره جلو پسره می گه: فقط فیس بوکتو باز کن ببینم!""","""
        آقا تو مراسم شب چله همه فامیل جمع بودن، یه ۳۰ نفری بودن. مجلس که خوب گرم شد من و داداشم شروع کردیم به تعریف پیشگویی آخر زمان و نابودی زمین که امشب اتفاق می افته و اینا!

        خوب که با حرفامون ترس انداختیم به همه یواشکی تو شلوغی جیم شدیم رفتیم برق رو قطع کردیم و یه ترقه هم انداختیم. آقا قیامتی شدا! زن ها جیغ می زدن، بچه ها گریه می کردن، چندتایی هم غش کردن. من و داداشمم رو زمین می غلتیدیم از خنده. دیگه برق رو وصل کردیم و گفتیم نترسین شوخی بود!

        این شد که الان داداشم تو بیمارستانه با دست و پای شکسته، منم پناهنده شدم به خونه دوستم تا از کشته شدن توسط فامیل در امان باشم!""","""
        تمام مکالمات من و بابام در طی سال:

        «بیا ببین این گوشی من چشه

        بزن اخبار گوش کنیم

        بزن ۳

        چراغا رو خاموش کن

        خونه سرد شد کولرو خاموش کن

        چشات در نیومد پای لپ تاپ؟»

        اگه چیزی از قلم افتاده شما ادامه بدین!""","""
        پسر داییم بعد از ۱۰ سال از آمریکا اومده

        نشسته بودیم داشتیم حرف می زدیم، حرف از گرونی و قیمت دلار شد.

        مامانم می پرسه:الان دلار تو آمریکا چنده؟!""","""
        پشتِ سر هر انسان موفق یه عالمه حرف هست.

        مثل: پدر سگِ دزد!""","""
        شمام از این سیستم ها دارین که روزها لباس ها رو از روی صندلی به روی تخت، و شب ها از روی تخت به روی صندلی منتقل کنید؟

        ""","""
        قانون پایستگی واحد: واحدها نه از بین می روند نه پاس می شوند بلکه از ترمی به ترم دیگر منتقل می شوند.

        ""","""
        ۱۰ سال پیش تو یک فیلم هندی،

        آمیتا باچان از کما و تخت آی سی یو بلند شد

        رفت تو حیاط ۳۰، ۴۰ نفر رو لت و پار کرد

        بعدش دوباره برگشت به تختش.

        از اون به بعد مسیر زندگیم عوض شد.""","""
        درسته پراید کولرش خوب نیست ولی وُژدانی بخاریش خوب خنک می کنه!

        ""","""
        بزرگترین فایده ورزش اینه که سالم می میری

        ""","""
        روزامون برعکس شده، صبح خسته از خواب بلند می شیم، شبا پر از انرژی می خوابیم.

        ""","""
        عدالت یعنی چی؟

        عدالت یعنی اینکه یکی هفت میلیارد پول از باباش ارث می بره و یکی کچلی""","""
        مکالمه تلفنی با مامان ها:

        سلام، باشه، اوهوم، باشه، آره، می دونم، آره، خب، نمی دونم، شاید، حواسم هست، اوکی، می دونم مادر من، خیلی خب، باشه، اوکی، چشم، یادم می مونه، آره، باشه، خداحافظ.

        ۲۶- اگه بخوای خلبان بشی، هزار جور مریضی داری ولی بخوای معافیت پزشکی بگیری، سالم سالمی!""","""
        مامان شماهم بحث رو از لیوانای کثیفی که تو اتاقتون مونده به اخلاق گوهتون که به خانواده ی پدریتون رفته ربط میده؟

        ""","""
        مشهدیا یه واحد پولی داریم به اسم
        “دم حرم همینو میدن انقدر”""","""
        ﺭﻓﺘﻪ ﺑﻮﺩﻡ ﺩﺳﺘﺸﻮﯾﯽ ﭘﺎﺭﮎ

        ﯾﮑﯽ ﮔﻮﺯﯾﺪ ﻣﻦ ﺑﻠﻨﺪ ﺧﻨﺪﯾﺪﻡ، ﯾﺎﺭﻭ ﺍﺯ ﻫﻤﻮﻥ ﺗﻮﯼ ﺗﻮﺍﻟﺖ ﮔﻔﺖ ﮐ..ﻮﻧﻪ ﺩﯾﮕﻪ،
        ﻫﺎﯾﺪﻩ ﮐﻪ ﻧﻤﯿﺨﻮﻧﻪ!
        .
        .
        .
        .

        ﺗﻮ ﻋﻤﺮﻡ ﺍﯾﻨﺠﻮﺭﯼ ﻗﺎﻧﻊ ﻧﺸﺪﻩ ﺑﻮﺩﻡ😂😂😂😂😂😂😂😂""","""
        پسرﻩ ﻧﻮﺷﺘﻪ: ﺑﻪ ﻣﻦ ﺩﻝ نبند!
        من از نسل بادم…

        نمیدونم چرا هرچى فکر میکنم غیر گوز گزینه ى دیگه اى به ذهنم نمیرسه😂😂""","""
        دیروز رفتم دکتر متخصص، دیدم ویزیتش ۱۶۰ هزار تومان شده!😏
        به دکتر گفتم:

        اگر تخفیف میدی بگم کجام درد میکنه وگرنه خودت بگرد پیداش کن!😜

        والا
        اینهمه پول میگیرن جای درد هم خودمون باید بگیم!😐😂😂😂😂""","""
        طرف از دار دنیا یه شلوار👖 داره 😓

        که اونم کادو🎁 واسه باباش آوردن 😐

        کوچیک بوده دادن این بپوشه 😐

        بعد توی خواستگاری جوری میگه دنیارو به پات میریزم

        کسی که ندونه خیال میکنه طرف امپراطور چوسانِ قدیمه!😂😁😂😁😂""","""
        امان از دسته این مانکنای جلویه مغازه‌ها امروز دماغ یکیشونو گرفتم برگشت بهم گفت مرض داری؟ نگو صاحب مغازه بود!! 😐

        ""","""هیچوقت از روی ظاهر کسی قضاوت نکنین
        الان مثلا به قیافه سیب‌زمینی میاد انقدر خوشمزه باشه؟""","""
        من نمیدونم این مامانا که وسایل خودشون رو یه جایی میزارن

        بعد خودشونم یادشون میره کجاس…

        چه جوریه که تو پیدا کردن وسایلی

        که ما به اصطلاح تو ۷ تا سوراخ موش قایم می‌کنیم تبحر خاصی دارن!!!""","""
        یکی ﺍﺯ ﺗﻔﺮﯾﺤﺎﺕ ﻧﺎﺳﺎﻟﻤﯽ ﮐﻪ ﺩﺍﺭﻡ ﺍﯾﻨﻪ ﮐﻪ :

        ﻫﺮ ﻭﻗﺖ ﻣﯿﺮﯾﻢ ﺷﻬﺮﺑﺎﺯﯼ ﭼﻨﺪﺗﺎ ﭘﯿﭻ ﻭ ﻣﻬﺮﻩ ﺑﺎ ﺧﻮﺩﻡ ﻣﯿﺒﺮﻡ

        ﻫﺮ ﻭﺳﯿﻠﻪ ﺍﯼ ﮐﻪ ﺳﻮﺍﺭ ﻣﯿﺸﯿﻢ

        ﺑﻪ ﺑﻐﻞ ﺩﺳﺘﯿﻢ که ﺍﺻﻮﻻ ﺁﺩﻡ ترسوییه

        ﻣﯿﮕﻢ : ﯾﺎ ﺧﺪﺍ ﺍﯾﻦ ﺩﯾﮕﻪ ﺍﺯ ﮐﺠﺎ ﺑﺎﺯ ﺷﺪ ؟

        اونم که مثل سگ میترسه""","""
        یه چیزی که مدت‌ها نگهش داشتی و دیگه به دردت نمیخوره رو بندازش دور.
        حالا اگه یک ساعت بعدش همون جنس به کارت نیومد بیا بزن تو گوش من!""","""
        ""","""
        رفتم کبابی چلو کبابش شیرین بود!

        گفتم آقا چرا شیرینه کبابتون؟

        گفت پیاز گرونه موز چرخ کردم!""","""
        ‏‌ما زشتا رو وقتی میخوان دلمون نشکنه

        بهمون میگن چه چهره معصومی داری :/""","""
        یه مردی بود که هر شب جمعه میرفت بهشت زهرا و بالای یه قبری مینشست و زار زار گریه میکرد و میگفت:

        چرا رفتی و منو بدبخت کردی…

        بهش گفتن این کیه که هر شب جمعه سر مزارش گریه میکنی؟!

        برادرته؟
        پدرته؟
        بچته؟
        کیته؟

        میگه: هیچکدوم!

        این شوهره اول زنمه…!!""","""
        یه بارم رفتم سر قرار به دختره زنگ زدم گفتم:

        من نیم ساعته رو نیمکت نشستم نتونستی بیای؟

        ‏گفت: تو همونی که تیشرت باب اسفنجی پوشیدی

        جوراب صورتی پاته با صندل؟

        گفتم: اره

        گفت: نه نتونستم بیام.""","""
        میگه: چرا زن نمی‌گیری؟

        میگم: مرسی من همینطوری راحتم

        میگه :‌آخه ما ناراحتیم تو راحتی!!""","""
        ایرانیا رو از چهار تا چیز میشه شناخت :

        – همشون زیرشلواری آبی راه راه دارن

        – هر قلوپ نوشابه که میخورن به شیشه نگاه میکنن ببینن تا کجاش رفته

        – جلوی در وامیستن و به جای اینکه بگن بفرمایین تو، میگن حالا چرا نمیان تو؟

        – بستنی لیوانی که میخورن حتما درش رو میلیسن""","""
        واتساپ در زمینه‌ی پاک کردن پیاما،

        مثل این بچه کوچیکاس که

        بهش گفتن بگو بابام خونه نیس،

        اونم نه میذاره و نه برمیداره،

        میگه بابام میگه که بگو بابام خونه نیس""","""
        ﺍﻭﻣﺪﻡ ﮐﺎﺭ ﺍﻣﺮﻭﺯﻣﻮ ﺑﻨﺪﺍﺯﻡ ﺑﺮﺍ ﻓﺮﺩﺍ…
        ﺑﻠﻨﺪ ﺍﻧﺪﺍﺧﺘﻢ ﺍﻓﺘﺎﺩ ﭘﺲ ﻓﺮﺩﺍ
        ﺍﻧﻘﺪ ﺧﻮﺷﺤﺎﻟﻢ ﺍﻻﻥ""","""
        بَ رَ بَ بَ چیست؟

        به معنای برو باباست که ایرانی‌ها در پاره‌ای مواقع با دهن کجی، برای تضعیف

        روحیه طرف مقابل بکار می‌برند!!

        الان دارید امتحان می‌کنید؟؟

        تبریک میگم شما یک ایرانیه اصیل هستید!""","""
        خانمه میره بانک سهام عدالتش رو بگیره،

        بانکیه میگه: بریزمش به حساب جاریتون؟

        خانمه میگه: نه بریز به حساب خودم،

        جاریم بمیره ایشالا،

        چقدرم شانس داره تو بانکم هواشو دارن!""","""
        به یارو گفتن: اگه پلنگ دنبالت کنه چکارمی‌کنی؟
        گفت: میرم بالای درخت.
        گفتن: اگه اومد بالای درخت چی؟
        گفت: میرم سر شاخه درخت.
        گفتن: اگه اومد سر شاخه چی؟
        گفت: والا پلنگ ولم می‌کنه، ولی توی داغون ولم نمی‌کنی!""","""
        اومدم خونه مادرم نمازش تموم شده بود، داشت دعا می‌كرد … تا منو دید گفت: اینو می گما خدا…

        نمی دونم داشت پشت سر من به خدا چی می گفت…""","""
        دیروز رفتم نمایشگاه ماشین
        یه دونه مازراتی دیدم خیلی خوشم اومد
        این ماه حقوقمو که بگیرم…
        یه آژانس میگیرم میرم دوباره میبینمش!""","""
        استفاده از دستمال توالت تو ایران اینجوریه که

        اول خودتو خشک میکنی

        بعد باید یه بار دیگه آب بکشی

        دستمالایی که بهت چسبیدن برن :/""","""
        یکی از بزرگترین حسرتام مال وقتیه که میرم خونه‌ی کسی واسش شیرینی خامه‌ای می‌برم!

        بعدش تا آخر مهمونی منتظر میشم بلکه یه تیکشو بیاره با چایی بخوریم ولی نمیاره لعنتی!""","""
        کی میگه ما مردا احساسات نداریم؟

        من خودم هر روز نزدیکای ساعت یک شدیدا احساس گشنگی می‌کنم

        شاید باورتون نشه ولی بعدش که ناهارمو خوردم تازه احساس تشنگیه که ول کن نیست!""","""
        دادم هارد لپ تاپمو ریکاوری کردن‌ الان یه هفتس زنگ می‌زنن می‌گن بیا ببرش، اما روم نمیشه برم…

        ""","""
        کشتی در حال غرق شدن بود،
        کاپیتان سراسیمه پرسید:
        کسی دعا کردن بلده؟

        یک روحانی با افتخار گفت:
        من کارم دعا کردنه

        کاپیتان گفت:
        پس شما برای خودت دعا کن،
        ما به بقیه جلیقه نجات میدیم،
        چون یه جلیقه کم داریم!!""","""
        مغز جالبترین عضو بدنه

        از زمان تولد تا موقع مرگ کار می‌کنه به جز سر امتحان

        خاک تو سرش""","""
        رفتم داروخانه چسب زخم بگیرم
        نداشتن…
        دختره افتاده دنبالم
        میگه
        خودم مرهم زخمات میشم
        چشم و چراغ خونت میشم""","""
        به مامانم هر چی میگم

        میگه برو شوهر کن،

        بعد هرکار میخوای بکن!

        حالا منتظریم یه صاحب جدید پیدا شه،

        انتقال مالکیت بدیم -__-""","""
        هیچ لذتی اندازه‌ی این که یه بچه‌ی کوچولو دستشو دراز کنه طرفت که یعنی بغلم کنی نیس و حال نمیده!!! اصن یه لذت عجیبی داره!!!""","""
        به بابام میگم ۲۷ سالم شده نمیخوای برام آستین بالا بزنی…
        میگه: والا اگه کسی راضی بشه با تو ازدواج کنه آستین که سهله با شورت میرم خواستگاری برات!
        یعنی اینقد تو خونواده منو قبول دارن""","""
        یکی از مربیای آموزشگاه رانندگی تعریف میکرد
        برای خانمی دور دو فرمون رو توضیح دادم
        خانمه هم با کلی دقت گوش میداد
        منم خوشحال شدم
        گفتم
        خانم متوجه شدین ؟
        گفت بله فقط برای دور
        دو فرمون اون یکی فرمون کجاست ؟""","""از یه اسبه می‌پرسن چرا هر کس تورو می‌بینه سوارت میشه؟

        اسبه جواب نداد… سرشو انداخت پایین و هیچی نگفت.

        می‌دونی چرا؟؟؟

        چون اسبا نمی‌تونن حرف بزنن.

        نه واقعا انتظار داشتی اسبا حرف هم بزنن؟:| حتما از پایان نامه ارشدتم دفاع کردی!""","""بابام با ماشین تصادف کرده
        زنگ زده به من فحش میده‌
        می‌گم: چی شده؟ میگه: تصادف کردم‌
        می‌گم: چرا به من فحش می‌دی؟
        میگه: وقتی تصادف کردم داشتم به تو فک می‌کردم بی‌پدر!""","""
        امروز نمی‌دونم جواب کدوم کار خوبم رو گرفتم!

        رفتم صدگرم نخودچی گرفتم، داشتم می‌خوردم

        که یهو دیدم یه پسته توشه!

        باور کنید اشک توی چشمام حلقه زده بود""","""
        ﺷﺎﻡ ﻣﻬﻤﻮﻥ ﺑﻮﺩﯾﻢ، ﺳﺮ ﺳﻔﺮﻩ ﺑﻪ ﺑﺎﺑﺎﻡ ﻣﯿﮕﻢ، ﺍﻭﻥ ﭘﺎﺭﭺ ﺁﺏ ﺭﻭ ﻣﯿﺪﯼ؟
        ﺯﺩ ﭘﺲ ﮐﻠﻪﺍﻡ ﻧﺰﺩﯾﮏ ﺑﻮﺩ ﺳﺮﻡ ﺑﺮﻩ ﺗﻮ ﺑﺸﻘﺎﺏ
        ﻣﯿﮕﻢ ﭼﺮﺍ میﺰﻧﯽ؟
        ﻣﯿﮕﻪ: ﺧﺎﮎ ﺑﺮ ﺳﺮ ﺧﺮﺕ ﮐﻨﻦ!
        ﺁﺏ ﮐﻪ ﺧﻮﻧﻪ ﺧﻮﺩﻣﻮﻧﻢ ﻫﺴﺖ… ﺟﻮﺟﻪ ﺑﺨﻮﺭ بدبخت!""","""
        ایرانسل در آینده‌ای نزدیک:

        مشترک گرامی چه خبر؟ مامان بابا خوبن؟

        بچه کوچولو چه طوره؟ الهی ایرانسل قربونش بره

        مشترک گرامی یه طرح دارم پاییزه یکی سیم کارت بخر، دوتا ببر

        یکی میاره در خونتون یکی می‌دم به عموتون یکی هم واسه عمتون!

        مشترک گرامی کاری باری نداری فعلا؟ قربونت ایرانسل!"""]
                            renn= choice(rando)
                            await client.send_message(my_group,renn,reply_to_message_id=msg)
                        if message.raw_text == "بیو" or message.raw_text == "بیوگرافی":
                            rando = ["اگر از بلندای آسمان بترسی، نمی‌توانی مالکِ ماه شوی! 🌖✨ ️ ","༺ زندگے ات یـک قصـہ ایـست کـہ توسط یـک خداے خوب نوشتـہ شده! ༻️ ","ناشنوا باش وقتی کهـ به آرزوهای قشنگت میگن محالهـ💘🍀✨  ️ ","👑پادشاه جهنم خودت باش نه کارگر بهشت دیگران👑 #سنگین ️ "," «‌ترجیح میدهم به ذوقِ خویش دیوانه باشم تا به میلِ دیگران عاقل...» زندگی یعنی همین! ️ "," ♡ ♡ ربنا آتنا بغلش آرامشنا ♡ ‌ ‌◉━━━━━━─────── ↻ㅤ ◁ㅤㅤ❚❚ㅤㅤ▷ㅤㅤ⇆️ ","از هرجا بیوفتے ڪمڪت میڪنم بلند شی،هرجا جز چشمام! ️ ","همیشه به قلبت گوش بده درسته که طرف چپ بدنته، ولی همیشه راستشو میگه ♥️ ️ ","زشتی دنیا به خاطر وجود آدمای بد نیست ! به خاطر سکوت آدمای خوبه ...  ️ ","هیچ‌کس‌نفهمیدِꔷ͜ꔷ▾‹🖤⃟🌻›' که‌خداوندهمِꔷ͜ꔷ▾‹🥀⃟🕸›' تـــــنـهاییـش‌رافریادزدِꔷ͜ꔷ▾‹🔞⃟🌙›' _قُل‌هُوَاللّهُ‌اَحَدِꔷ͜ꔷ▾‹💔⃟🌿›' ️ ","بِدون‌ِتـومَگِه‌میشِه‌زِندِگی‌ڪَرد∘ ️ ","از دریا اموختم🌹هر کس از حدش گذشت غرقش کنم😍 ️ ","بخند، شایسته‌ی ماه نیست که غمگین باشه ⚠️♥️ ️ ","بخند، شایسته‌ی ماه نیست که غمگین باشه ⚠️♥️ ️ ","مرگ درمانیست برای اتمام درد زندگی ... و اکنون ، درمانم ارزوست ...🖤🥀🕸 ️ "," از گوش دادن به یه مشت حرف دروغ لذت می‌برم، وقتی‌که حقیقت رو می‌دونم... ️ ","گَر نباشد رنگِ رویا به چه دِل باید سِپرد :)؟! ️ ","آرزویت را برآورد میکند ، آن خدایی که آسمان را برای خنداندن گلی میگریاند . . . ️ ","تنها کسی که نگاهش کردم |تو| بودی من بقیه رو فقط میبینم . . 🌙♥️• ️ ","☘  روزهای سخت قیمت آدمای دورتو معلوم میکنه! 🔥☝️   ️ ","'خوشبَختی' یَعنی : ‌بُـودنش بهترین 'شانسِ' زنـدگیتـه..♥️ ️ ","‹ قوی باش ، چون خدا فقط کسی رو به لبه پرتگاه میرسونه که ؛ قدرت پرواز رو داشته باشه ... › ️ ","•|چـرا ایـن نیـز دیـگر نـِمـیـگـذَرَد ..:)؟• ️ ","ز گیتی دو کس را سپاس...یکی حق شناس و یکی حد شناس :) 🍃🌸 ️ ","نامه‌ای به خودم: الان دیگه فقط تورو دارم مراقبم باش :)    ️ ","  حواست به این باشه که وقتی خوشحالی کی برات خوشحاله!  ️ ","♛ خیلیا بهم یاد دادن که میتونن باهام بازی کنن.♛ 彡منم یه روز بهشون یاد میدم که بازی رفت و برگشت داره彡️ ","اگر دیدی کسی از تنهایش لذت میبره؛ بدون راز قشنگی تو دلش داره...🖤 و اگه تونستی حریم این تنهایی رو بشکنی بدون تو از رازش قشنگ تری...🙂 ️ ","   من عشق‌رو آرزو کردمو تو مستجاب شدی..!🦋 ️ ","این کلمه‌ها زندگی من هستن: مامان و بابام♥️ ️ ","هیچ گونه از زیبایی درخشان‌تر از «یه قلب پاک» نمی‌درخشد. ✨ ️ ","عاشقت که شدم:  عقلم کیش شد، قلبم مات❤️ ️ ","پـــــــــــرواز کن تا آرزو 😉✈️ زنجیــــر را بــــــاور نکن ⛓✨ ️ ","پـــــــــــرواز کن تا آرزو 😉✈️ زنجیــــر را بــــــاور نکن ⛓✨ ️ ","نگران حرف مردم نباش خدا پرونده ای را که مردم مینویسند    نمیخواند... ️ ","⌈ دَر دِلِ بینَوایِ مَن عِشقِ تُو چَنگ می‌زَنَد!❤️🔗 ⌋ ️ ","اگه سکوت میکنم معنیش این نیست که دارم حق رو به تو میدم بلکه به سادگی دارم تورو نادیده میگیرم :) ️ ","به سݪاݥتے ڱڔگے ڪع تا فهݥید چؤپان خؤاب است باز زؤزه اش را ڪشید تا از پشت خنجڔ نزند 😊😍 ️ ","‌‌🌿 میشه‌ از‌ وُیسات‌ قرص‌ِ آرامبَخش‌ساخت..🎼 . ️ ","چیز‌هایی که می‌شنوی رو زود باور نکن چون دروغ‌ها سریعتر از حقیقت پخش می‌شن :)) ️ ","  راضی باش به رضای او... 👤 سوره طور ️ ","ذهنای بزرگ پُراز هدف هستن، ذهنای کوچیک پراز آرزو! ️ ","ذهنای بزرگ پُراز هدف هستن، ذهنای کوچیک پراز آرزو! ️ ","‌‌‌‌🌿 انقلاب، فقـط لبخنـدش..! (:  ‌‌‌‌ ️ ","هیچ کسی از داستان کسی دیگه خبر نداره؛ درد یک سُفره‌ی تک نفرست ️ ","باب اسفنجی:میدونی هرچی مشکل دارم از سادگیمه.. پاتریک:دیگه ساده نباش؛راه راه باش:)‌ ️ ","اندوهت را بتکان،جهان منتظرت نمی ماند تا حالت خوب شود🌿💛 ️ "," - اﻧﻗَﺩࢪ ﻧﮔࢪﺩ ﺩﻧﺑالِ اﻭنے ﻛِ‌‍ہ اﺯ ﻗَﺻﺩ ﮔﻣِﺗ ﻛࢪدِ‍‌؏..!'•ᤩ😹➰  ‌‌‌‌‌ ️ ","تو متعلق به غم و اندوه نیستی؛ بی‌خیال اون چیزی شو که روی قلبت سنگینی می‌کنه ✨ ️ ","به هرکس می‌نگرم در شکایت است : در حیرتم که لذت دنیا به کام کیست ؟! ️ "," وقتی یه دختر جوری رفتار میکنه که انگار بهت اهمیت نمیده ، اون موقع‌ست که بیشتر از همیشه بهت احتیاج داره . ️ ","•فِكرایِ توْ سَرَم اَز هَنزفِريم پيچيدِه تَرَن♥️ ","تو اون بخشی از وجود منی که هرگز نمی‌میره♡ ️ ","هیچ لباسی تو دنیا، نمیتونه بی‌شخصیتیه درون آدما رو بپوشونه👌 ️ ","دکتر انوشه راست میگه که : 'گیرم عذر خواهی کردی ، واسه حرفی که زدی' با ذاتی که آشکار شده چه میکنی ؟! ️ ","برات اشک آرزو می‌کنم! نه در اوج غم، در اوج خنده …💛 ️ ","با نگاه کردن به گذشته وقت تلف نکن. به اون سمت نمیری🌹 ️ ","وقتی چیزی تموم شد، ترکش کن به آبیاری یه گل مرده ادامه نده ️ "," بعضی از آدما عین ریشه می‌مونن، باعث می‌شن قوی و استوار باشی 🌱 ️ ","خدا یاری‌ کند قلبی را که  در آرزوی چیزیست که تقدیرش نیست  ️ ","‏‌ انسانها همه چیو نابود میکنند، پنهان زندگی کن‌ ! ️ ","آنجا که گلها شکوفه میکنند ، اُمید حضور دارد . .💛🌻 ️ ","آنجا که گلها شکوفه میکنند ، اُمید حضور دارد . .💛🌻 ️ "]
                            renn= choice(rando)
                            await client.send_message(my_group,renn,reply_to_message_id=msg)
                        if message.raw_text == "ساعت" or message.raw_text == "تایم":
                            jd = requests.get("http://api.codebazan.ir/time-date/?td=time").text
                            await client.send_message(my_group,f"گلم ساعت **{jd}** هست",reply_to_message_id=msg)
                        if message.raw_text.startswith("سرچ : "):
                            author_guidgg = message.author_guid
                            print(author_guidgg)
                            search_text = message.text.split(":")[-1].strip()
                            num_results = 5
                            try:
                                search_results = search(search_text, num_results=num_results)
                                result_list = list(search_results)
                                s = Shortener()
                                result_string = "نتایج جستجو:\n"
                                for i, result in enumerate(result_list, start=1):
                                    short_url = s.tinyurl.short(result)
                                    result_string += f"{i}. {short_url}\n"
                                print(result_string)
                                await client.send_message(my_group,f"#𝓢𝓮𝓪𝓻𝓬𝓱_𝓖𝓸𝓸𝓰𝓮𝓵:\n\nلینک های دریافتی:\n{result_string}",reply_to_message_id=msg)
                            except Exception as e:
                                print("An error occurred:", e)
                        if message.raw_text.startswith("فونت :"):
                            author_guidgg = message.author_guid
                            print(author_guidgg)
                            text_wbw = message.text.split(":")[-1].strip()
                            responsew = requests.get(f"https://api.codebazan.ir/font/?text={text_wbw}")
                            jokgw = responsew.text
                            jdw = json.loads(jokgw)['result']
                            resultw = [f"{i}. {jdw[str(i)]}" for i in range(1, 101) if str(i) in jdw]
                            await client.send_message(author_guidgg,'\n'.join(resultw))
                            await message.reply("🔷 نتایج کامل به پیوی شما ارسال گردید 🔷")

                        if message.raw_text.startswith("فونت فارسی : "):
                            author_guidgge = message.author_guid
                            text_wbq = message.text.split(":")[-1].strip()
                            responseq = requests.get(f"https://api.codebazan.ir/font/?type=fa&text={text_wbq}")
                            jokeq = responseq.text
                            jdq = json.loads(jokeq)['Result']
                            resultq = [f"{i}. {jdq[str(i)]}" for i in range(1, 10) if str(i) in jdq]
                            await client.send_message(author_guidgge,'\n'.join(resultq))
                            await message.reply("🔷 نتایج کامل به پیوی شما ارسال گردید 🔷")

                        if message.raw_text.startswith("ربات کی") or message.raw_text.startswith("رباط کی"):
                            result = await client.get_group_all_members(my_group)
                            jd = json.loads(str(result))  # تبدیل نتیجه به رشته و سپس به دیکشنری
                            in_chat_members = jd['in_chat_members']
                            first_names = [member.get('first_name', '') for member in in_chat_members if 'first_name' in member]
                            if first_names:
                                random_first_name = random.choice(first_names)
                                print(random_first_name)  # نمایش نام تصادفی
                                await message.reply(f"فکر کنم {random_first_name}")
                        if message.raw_text.startswith("ترجمه به فارسی : "):
                            text_wb = message.text.split(":")[-1]
                            response = get(f"https://api.codebazan.ir/translate/?type=json&from=en&to=fa&text={text_wb}")
                            data = json.loads(response.text)
                            text = data['result']
                            await message.reply(text)
                        if message.raw_text.startswith("ترجمه به انگلیسی : "):
                            text_wb = message.text.split(":")[-1]
                            response = get(f"https://api.codebazan.ir/translate/?type=json&from=fa&to=en&text={text_wb}")
                            data = json.loads(response.text)
                            text = data['result']
                            await message.reply(text)
                        if message.raw_text.startswith("اوقات شرعی : "):
                            text_wb = message.text.split(":")[-1]
                            string = ''
                            response = requests.get(f"https://api.codebazan.ir/owghat/?city={text_wb}")
                            if response.status_code == 200:
                                try:
                                    response = response.json()
                                    if response.get('Ok'):
                                        results = response.get('Result')
                                        for result in results:
                                            try:
                                                string += ''.join(['● شهر : ', result.get('shahr'), '\n', '● تاریخ : ', result.get('tarikh'),'\n', '● اذان صبج : ', result.get('azansobh'),'\n', '● طلوع صبح : ', result.get('toloaftab'),'\n', '● اذان ظهر : ', result.get('azanzohr'),'\n', '● غروب افتاب : ', result.get('ghorubaftab'),'\n', '● اذان مغرب : ', result.get('azanmaghreb'),'\n', '● نیمه شب : ', result.get('nimeshab')])
                                            except TypeError:
                                                continue
                                        await message.reply(string)
                                    else:
                                        await message.reply("خطا در دریافت اطلاعات. لطفاً مجدداً تلاش کنید.")
                                except Exception as e:
                                    traceback.print_exc()
                                    await message.reply("خطای ناشناخته رخ داد.")
                            else:
                                await message.reply("خطا در دریافت اطلاعات. لطفاً مجدداً تلاش کنید.")
                    if message.author_guid in admins and message.raw_text == "پاکسازی":
                        await deleteMessages(client , message.message_id)
                    
                    if locks.locks["حالت سخنگو"] == True:
                        for item in sokhan:
                            keyword, reply = item.split(":")
                            if message.raw_text == keyword:
                                await client.send_message(my_group,reply,reply_to_message_id=msg)
                                break

                    if locks.locks["خوشامد گویی"] == True:
                        result = await client.get_group_info(my_group)
                        jd = result['group']['group_title']
                        current_time = datetime.datetime.now()
                        formatted_time = current_time.strftime("%H:%M:%S")
                        current_date = datetime.date.today()
                        formatted_dated = current_date.strftime("%Y-%m-%d")
                        if message.raw_text == "یک عضو از طریق لینک به گروه افزوده شد.":
                            await message.delete_messages()
                            message_id = message.message_id
                            with open("wink-eye.mp4", "rb") as gif_file:
                                gif_data = gif_file.read()
                            resl = await client.send_gif(my_group, gif=gif_data, file_name="wink-eye.mp4" ,caption='✅یک کاربر در تاریخ:\n' + formatted_dated + '\n' + formatted_time + '\n به گروه  ' + jd + ' پیوست ✅\n @Id_Recod | کانال رسمی آرکد',reply_to_message_id=message_id)
                            jde = resl['message_update']['message_id']
                            await client.delete_messages(my_group,message_ids=jde)
                        if message.raw_text == "یک عضو گروه را ترک کرد.":
                            await message.delete_messages()
                            reslg = await client.send_message(my_group,'❌یک کاربر در تاریخ:\n' + formatted_dated + '\n' + formatted_time + '\n از گروه  ' + jd + ' لفت داد ❌\n @Id_Recod | کانال رسمی آرکد',reply_to_message_id=msg)
                            jd = reslg['message_update']['message_id']
                            await client.delete_messages(my_group,message_ids=jd)
                    if locks.locks["عمل حذف گیف"] == False:
                        if 'messages' in result and len(result['messages']) > 0:
                            message = result['messages'][0]
                            if message.get('type') == 'FileInline' and message.get('file_inline').get('type') == 'Gif':
                                await message.delete_messages() # created by shayan heidari | rubpy
                                print('Delete A Gif.')
                    if locks.locks["قفل نظرسنجی"] == False:
                        if 'messages' in result and len(result['messages']) > 0:
                            message = result['messages'][0]
                            if message.get('type') == 'FileInline' and message.get('file_inline').get('type') == 'poll':
                                await message.delete_messages() # created by shayan heidari | rubpy
                                print('Delete A Gif.')
                    if locks.locks["عمل حذف ویس"] == False:
                        if 'messages' in result and len(result['messages']) > 0:
                            message = result['messages'][0]
                            if message.get('type') == 'FileInline' and message.get('file_inline').get('type') == 'Voice':
                                await message.delete_messages() # created by shayan heidari | rubpy
                                print('Delete A Gif.')
                    if locks.locks["قفل لوکیشن"] == False:
                        if 'messages' in result and len(result['messages']) > 0:
                            message = result['messages'][0]
                            if message.get('type') == 'FileInline' and message.get('file_inline').get('type') == 'location':
                                await message.delete_messages() # created by shayan heidari | rubpy
                                print('Delete A Gif.')
                    if locks.locks["عمل حذف عکس"] == False:
                        if 'messages' in result and len(result['messages']) > 0:
                            message = result['messages'][0]
                            if message.get('type') == 'FileInline' and message.get('file_inline').get('type') == 'Image':
                                await message.delete_messages() # created by shayan heidari | rubpy
                                print('Delete A Gif.')
                    if locks.locks["قفل موزیک"] == False:
                        if 'messages' in result and len(result['messages']) > 0:
                            message = result['messages'][0]
                            if message.get('type') == 'FileInline' and message.get('file_inline').get('type') == 'Music':
                                await message.delete_messages() # created by shayan heidari | rubpy
                                print('Delete A Gif.')
                    if locks.locks["حالت ضد فحش"] == False:
                        if not message.author_guid in admins and message.raw_text in Filter:
                            await message.delete_messages()
                            await client.send_message(my_group,"کاربر عزیز این کلمه به دستور ادمین فیلتر است لطفا از ارسال ان خودداری کنید.",reply_to_message_id=msg)
                    if locks.locks["حالت ضد لایو"] == False:
                        if 'messages' in result and len(result['messages']) > 0:
                            message = result['messages'][0]
                            if message.get('type') == 'FileInline' and message.get('file_inline').get('type') == 'live_data':
                                await message.delete_messages() # created by shayan heidari | rubpy
                                print('Delete A Gif.')
                    if locks.locks["حالت ضدفایل"] == False:
                        if 'messages' in result and len(result['messages']) > 0:
                            message = result['messages'][0]
                            if message.get('type') == 'FileInline' and message.get('file_inline').get('type') == 'File':
                                await message.delete_messages() # created by shayan heidari | rubpy
                                print('Delete A Gif.')
                    if locks.locks["حالت ضدفیلم"] == False:
                        if 'messages' in result and len(result['messages']) > 0:
                            message = result['messages'][0]
                            if message.get('type') == 'FileInline' and message.get('file_inline').get('type') == 'Video':
                                await message.delete_messages() # created by shayan heidari | rubpy
                                print('Delete A Gif.')
                    if locks.locks["حالت ضدلینک"] == False:
                        raw_text = message.raw_text
                        if raw_text is not None and not raw_text in admins and ("https:" in raw_text or "@" in raw_text):
                            await message.delete_messages()
                            await client.ban_group_member(my_group,message.author_guid)
                            await client.send_message(my_group,"کاربر عزیز شما به علت اراسال لینک اخراج میشوید.",reply_to_message_id=msg)
                            print('Delete A Link.')
                    if locks.locks["حالت فروارد"] == False:
                        if not message.author_guid in admins and 'forwarded_from' in message.to_dict().get('message').keys():
                            await message.delete_messages()
                            print('Delete A forwarded.')
                    if locks.locks["قفل روبینو"] == False:
                        if not message.raw_text in admins and message.raw_text and message.raw_text.startswith("//"):
                            await message.delete_messages()
                            print('Delete A PostRobino.')
                    

                    
        await client.run_until_disconnected()

run(main())
